Статистика работы механизмов/Конфигурация/DataProcessors/_КонтрольИнвестиционныхДеклараций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_КонтрольИнвестиционныхДеклараций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвестиционнаяДекларация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвестиционныеДекларации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПлановыеОперации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДинамическийРасчетСтоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Претрейд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтоПретрейд</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУчитывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАктива</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БрокерРасчетныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Депозит</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДепозитныеВклады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рынок</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Купон</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Классификация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПогашенияДепозита</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВторойЧастиРЕПО</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаРЕПО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СделкаСЦентральнымКонтрагентом</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дюрация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставГрупповогоКонтроля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвестиционнаяДекларация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвестиционныеДекларации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторРезультата</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДоговораДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_КонтрольИнвестиционныхДеклараций/Forms/РедактированиеСтрокиПретрейда/Ext/Form/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ЭтаФорма.Параметры, , "ЗакрыватьПриВыборе, ЗакрыватьПриЗакрытииВладельца, КлючНазначенияИспользования, ТолькоПросмотр");
	
	Если Не ЭтаФорма.ЭтоПретрейд Тогда
	
		ЭтаФорма.ТолькоПросмотр = Истина;
	
	КонецЕсли; 
	
	Элементы.ЦеннаяБумага.ОграничениеТипа = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(ЭтаФорма.Рынок);
	ЭтаФорма.ДюрацияПользовательская = ЭтаФорма.Дюрация <> 0;
	
	Если ЭтаФорма.СовокупнаяИнвестДекларация Тогда
		Элементы.СчетДоверительногоУправления.Видимость = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьВидимостьДоступность();
КонецПроцедуры
	
#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если ЭтаФорма.ВидАктива = "Ценные бумаги" И Не ЗначениеЗаполнено(ЭтаФорма.ЦеннаяБумага) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для продолжения необходимо выбрать ценную бумагу",, "ЦеннаяБумага"); 
		
	ИначеЕсли ЭтаФорма.ВидАктива = "Депозиты" И ЭтаФорма.Сумма > 0 И Не ЗначениеЗаполнено(ЭтаФорма.ДатаПогашенияДепозита) Тогда 	
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для продолжения необходимо заполнить дату погашения депозита",, "ДатаПогашенияДепозита"); 
		
	Иначе
		
		Если Не ЭтаФорма.ДюрацияПользовательская Тогда
			ЭтаФорма.Дюрация = 0;
		КонецЕсли;
		
		Результат = Новый Структура("ЭтоПретрейд, ВидАктива, БрокерРасчетныйСчет, Депозит, ЮрФизЛицо, Валюта, ЦеннаяБумага, ВидОперации, Рынок, Количество, 
				|Цена, Купон, Сумма, СуммаДС, Классификация, ДатаПогашенияДепозита, СчетДоверительногоУправления, Дюрация");
		ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма);
		ЗаполнитьПредставлениеНаСервере(Результат);
		Закрыть(Результат);
	
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти 

&НаКлиенте
Процедура ВидАктиваПриИзменении(Элемент)
	
	Если ЭтаФорма.ЭтоПретрейд И (ЭтаФорма.ВидАктива = "Депозиты" Или 
		(ЭтаФорма.ВидАктива = "Ценные бумаги" И ЭтаФорма.ВидОперации = 1)) Тогда
	
		ЭтаФорма.СуммаДС = - ЭтаФорма.Сумма;
		
	ИначеЕсли ЭтаФорма.ЭтоПретрейд Тогда 
		
		ЭтаФорма.СуммаДС = 0;
	
	КонецЕсли; 
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

#Область Элементы_группы_денежные_средства

&НаКлиенте
Процедура ДСБрокерРасчетныйСчетПриИзменении(Элемент)
	
	ЭтаФорма.Валюта = ПолучитьВалюту(ЭтаФорма.БрокерРасчетныйСчет);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ДСБрокерРасчетныйСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьСписокВыбораБрокерРасчетныйСчет(ЭтаФорма.СчетДоверительногоУправления, ЭтаФорма.Период);
	
КонецПроцедуры

#КонецОбласти 

#Область Элементы_группы_ценные_бумаги

&НаКлиенте
Процедура ВводВыводПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность();
	ОбновитьСуммуыПоЦБ(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦББрокерРасчетныйСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьСписокВыбораБрокерРасчетныйСчет(ЭтаФорма.СчетДоверительногоУправления, ЭтаФорма.Период);
	
КонецПроцедуры

&НаКлиенте
Процедура РынокПриИзменении(Элемент)
	
	Элементы.ЦеннаяБумага.ОграничениеТипа = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(ЭтаФорма.Рынок);
	
	Если ЭтаФорма.Рынок <> ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации") Тогда
		ЭтаФорма.Купон = 0;
	КонецЕсли;
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеннаяБумагаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ЭтаФорма.ЦеннаяБумага) Тогда
	
		ПараметрыРасчета = Новый Структура;
		
		ПараметрыРасчета.Вставить("Организация", 					ЭтаФорма.Организация);
		ПараметрыРасчета.Вставить("Период", 						ЭтаФорма.Период);
		ПараметрыРасчета.Вставить("ЦеннаяБумага", 					ЭтаФорма.ЦеннаяБумага);
		ПараметрыРасчета.Вставить("СчетДоверительногоУправления", 	ЭтаФорма.СчетДоверительногоУправления);
		
		СтруктураЦен 	= ПолучитьЦены(ПараметрыРасчета);
		ЭтаФорма.Купон 	= СтруктураЦен.Купон;
		ЭтаФорма.Цена	= СтруктураЦен.Цена;
		ЭтаФорма.Сумма 	= ЭтаФорма.Количество * (ЭтаФорма.Цена + ЭтаФорма.Купон);
		
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	ОбновитьСуммуыПоЦБ();
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	ОбновитьСуммуыПоЦБ();
КонецПроцедуры

&НаКлиенте
Процедура КупонПриИзменении(Элемент)
	ОбновитьСуммуыПоЦБ();
КонецПроцедуры

&НаКлиенте
Процедура ЦБСуммаПриИзменении(Элемент)
	
	Если ЭтаФорма.Сумма > 0 И ЭтаФорма.Количество < 0 
		ИЛИ ЭтаФорма.Сумма < 0 И ЭтаФорма.Количество > 0 Тогда
	
		ЭтаФорма.Количество = -1 * ЭтаФорма.Количество;
	
	КонецЕсли; 
	
	ЭтаФорма.Цена = ?(ЗначениеЗаполнено(ЭтаФорма.Количество), (ЭтаФорма.Сумма - ЭтаФорма.Купон*ЭтаФорма.Количество) / ЭтаФорма.Количество, 0);
	
	ОбновитьСуммуыПоЦБ(Ложь);
	
КонецПроцедуры

#КонецОбласти 

#Область Элементы_группы_депозиты

&НаКлиенте
Процедура ДепозитыВидОперацииПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность();
	Если ЭтаФорма.ВидОперации = 0 Тогда
		ЭтаФорма.СуммаДС = 0;
	Иначе
		ЭтаФорма.СуммаДС = -ЭтаФорма.Сумма;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДепозитыБрокерРасчетныйСчетПриИзменении(Элемент)
	
	ЭтаФорма.Валюта = ПолучитьВалюту(ЭтаФорма.БрокерРасчетныйСчет);
	
КонецПроцедуры

&НаКлиенте
Процедура ДепозитыБрокерРасчетныйСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьСписокВыбораБрокерРасчетныйСчет(ЭтаФорма.СчетДоверительногоУправления, ЭтаФорма.Период);
	
КонецПроцедуры

&НаКлиенте
Процедура ДепозитыСуммаПриИзменении(Элемент)
	
	Если ЭтаФорма.ВидОперации = 0 Тогда
		ЭтаФорма.СуммаДС = 0;
	Иначе
		ЭтаФорма.СуммаДС = -ЭтаФорма.Сумма;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаКлиенте
Процедура НастроитьВидимостьДоступность()
	
	Элементы.ГруппаДенежныеСредства.Видимость 	= Ложь;
	Элементы.ГруппаДепозиты.Видимость 			= Ложь;
	Элементы.ГруппаЦенныеБумаги.Видимость 		= Ложь;
	Элементы.ГруппаДЗКЗ.Видимость 				= Ложь;
	
	Если ЭтаФорма.ВидАктива = "Денежные средства" Тогда
		Элементы.ГруппаДенежныеСредства.Видимость 	= Истина;
	ИначеЕсли ЭтаФорма.ВидАктива = "Депозиты" Тогда
		Элементы.ГруппаДепозиты.Видимость 			= Истина;
	ИначеЕсли ЭтаФорма.ВидАктива = "Ценные бумаги" Тогда
		Элементы.ГруппаЦенныеБумаги.Видимость 		= Истина;
	ИначеЕсли ЭтаФорма.ВидАктива = "Дебиторская задолженность" Или ЭтаФорма.ВидАктива = "Кредиторская задолженность" Тогда
		Элементы.ГруппаДЗКЗ.Видимость 				= Истина;
	КонецЕсли; 
	
	Элементы.Депозит.Видимость = Не ЭтаФорма.ЭтоПретрейд;
	
	Элементы.ДепозитыВалюта.Видимость = ЭтаФорма.ЭтоПретрейд;
	Элементы.ДепозитыЮрФизЛицо.Видимость = ЭтаФорма.ЭтоПретрейд;
	
	ПокупкаПродажа = (ЭтаФорма.ВидОперации = 1);
	
	Элементы.ДепозитыБрокерРасчетныйСчет.Видимость = ПокупкаПродажа;
	Элементы.ДепозитыСуммаДС.Видимость = ПокупкаПродажа;
	
	Элементы.ЦББрокерРасчетныйСчет.Видимость = ПокупкаПродажа;
	Элементы.ЦБСуммаДС.Видимость = ПокупкаПродажа;
	
	СделкаРЕПО = (ЭтаФорма.ВидОперации = 2);
	
	Элементы.ГруппаСделкаРЕПО.Видимость = СделкаРЕПО;
	
	ЭтоОблигация = (ЭтаФорма.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации"));
	Элементы.Купон.Видимость = ЭтоОблигация;
	
	Элементы.ГруппаДюрация.Видимость = ЭтоОблигация;
	Элементы.Дюрация.Видимость = ЭтаФорма.ДюрацияПользовательская;

КонецПроцедуры 	

&НаСервереБезКонтекста 
Функция ПолучитьСписокВыбораБрокерРасчетныйСчет(СчетДоверительногоУправления, Период)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегистрСведенийКодыСчетовДоверительногоУправленияУБрокеров.Брокер КАК Брокер
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров КАК РегистрСведенийКодыСчетовДоверительногоУправленияУБрокеров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&ТекущаяДата, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО (УсловияДоговоровОбщиеСрезПоследних.Договор = РегистрСведенийКодыСчетовДоверительногоУправленияУБрокеров.ДоговорБрокерскогоОбслуживания)
		|ГДЕ
		|	(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения > &ТекущаяДата)
		|	И РегистрСведенийКодыСчетовДоверительногоУправленияУБрокеров.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РегистрСведенийИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет
		|ИЗ
		|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК РегистрСведенийИсполнителиПоДенежнымСредствамСобственные
		|ГДЕ
		|	(РегистрСведенийИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ РегистрСведенийИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия >= &ТекущаяДата)
		|	И РегистрСведенийИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления = &СчетДоверительногоУправления";
	
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ТекущаяДата", Период);
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0));
	Возврат СписокЗначений;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВалюту(БрокерРасчетныйСчет)

	Если ЗначениеЗаполнено(БрокерРасчетныйСчет) Тогда
	
		Если ТипЗнч(БрокерРасчетныйСчет) = Тип("СправочникСсылка.БрокерскиеКомпании") Тогда
			
			Возврат ПараметрыСеанса.ТекущаяОрганизация.ВалютаУчета;
			
		Иначе
			
			Возврат БрокерРасчетныйСчет.Валюта;
		
		КонецЕсли; 
	
	КонецЕсли; 

КонецФункции

&НаКлиенте
Процедура ОбновитьСуммуыПоЦБ(ПересчитатьСумму = Истина)

	Если ПересчитатьСумму Тогда
		ЭтаФорма.Сумма = ЭтаФорма.Количество * (ЭтаФорма.Цена + ЭтаФорма.Купон);
	КонецЕсли; 
	
	Если ЭтаФорма.ВидОперации = 0 Тогда
		ЭтаФорма.СуммаДС = 0;
	Иначе
		ЭтаФорма.СуммаДС = -ЭтаФорма.Сумма;
	КонецЕсли;	

КонецПроцедуры
 
&НаСервереБезКонтекста 
Функция ПолучитьЦены(ПараметрыРасчета)

	ЦеннаяБумага					= ПараметрыРасчета.ЦеннаяБумага;
	ВалютаНоминала 					= ЦеннаяБумага.ВалютаНоминала;
	Организация 					= ПараметрыРасчета.Организация;
	СчетДоверительногоУправления	= ПараметрыРасчета.СчетДоверительногоУправления;
	Период 							= ПараметрыРасчета.Период;
	ВалютаУчета 					= Организация.ВалютаУчета;
	
	НоминалВВалюте = (ВалютаНоминала <> ВалютаУчета);
	ТочностьОкругления = ?(НоминалВВалюте, 4, 2);
	
	Купон = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(ЦеннаяБумага, Период, СчетДоверительногоУправления,, ТочностьОкругления);
	
	Если НоминалВВалюте Тогда
		Купон = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Купон, ВалютаНоминала, Организация, Период);
	КонецЕсли; 
	
	Возврат Новый Структура("Купон, Цена", Купон, 0);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПредставлениеНаСервере(Результат)

	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	Результат.Вставить("Представление", ОбъектНаСервере.ПолучитьПредставлениеСтрокиПретрейда(Результат));

КонецПроцедуры

&НаКлиенте
Процедура ДюрацияПользовательскаяПриИзменении(Элемент)
	
	Элементы.Дюрация.Видимость = ЭтаФорма.ДюрацияПользовательская;
	
КонецПроцедуры
 
#КонецОбласти
